{
  "battery": {
    "disposal_method": "Batteries should be disposed of at authorized battery recycling centers. Do not dispose of in regular trash. Many electronics stores or collection points offer battery recycling services."
  },
  "keyboard": {
    "disposal_method": "Keyboards can be disposed of at electronic waste recycling centers. Some manufacturers also have take-back programs to ensure proper disposal and recycling."
  },
  "microwave": {
    "disposal_method": "Microwaves should be handed over to authorized e-waste recyclers. Some cities have special collection drives or centers for large appliances."
  },
  "mobile": {
    "disposal_method": "Old mobile phones can be dropped off at mobile phone stores with e-waste recycling programs or e-waste recycling centers. Some service providers also offer trade-in or take-back options."
  },
  "mouse": {
    "disposal_method": "Mice can be taken to e-waste recycling centers. Many electronics stores also accept old computer peripherals for proper recycling."
  },
  "pcb": {
    "disposal_method": "PCBs (Printed Circuit Boards) must be handled by specialized electronic waste recycling facilities due to the hazardous materials they contain."
  },
  "player": {
    "disposal_method": "Old media players should be taken to an e-waste collection center. Many brands have take-back programs for older devices."
  },
  "printer": {
    "disposal_method": "Printers can be disposed of at e-waste recycling centers. Some manufacturers or stores also offer programs for returning old printers."
  },
  "television": {
    "disposal_method": "Old televisions, especially CRT TVs, should be handed over to certified e-waste disposal companies. Many authorized service centers offer collection services."
  },
  "washingmachine": {
    "disposal_method": "Washing machines should be disposed of through e-waste collection drives or by contacting the manufacturer for recycling programs. Authorized dealers may also offer take-back services."
  }
}
